feijie825/gonghao/LM3S21xx_watchdog.c
/******************** (C) COPYRIGHT 2008 LUMINARY LM3S21xx ********************
;* File Name          : LM3S21xx_watchdog.c
;* Author             : 张力阵
;* 看门狗配置
;* 看门狗时钟被使能后,自动开始计数 没有其它触发 停止计数只能禁能看门狗时钟
;* 看门狗锁定后写中断清除寄存器 仍可清除中断,其它寄存器写操作无效(LOCK寄存器除外)
;* 寄存器锁定后可通过向LOCK寄存器写入 0x1ACCE551(WDT_LOCK_UNLOCK)解锁
*******************************************************************************/
#include "LM3S2139.h"
#include "LM3S21xx_Lib.h"
#include "LM3S21xx_types.h"
#include "define.h"
#include "vari.h"

/*****************************************************************************
* 初始化看门狗 
*****************************************************************************/
void Init_Wdt(void)
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_WDOG);     //使能看门狗设备SYCTL_RCGC(使能时钟) .
	   WatchdogUnlock();								//解锁
    WatchdogIntClear();                             //清除看门狗中断
    WatchdogReloadSet((Sysclk/1000)*WATCH_TIME);    //设置看门狗周期
    WatchdogResetEnable();				            //看门狗溢出复位使能
	   WatchdogStallEnable();
    WatchdogEnable();					            //看门狗中断启动
}
/*****************************************************************************
* 喂狗程序 
*****************************************************************************/
void WDTFeed(void)
{
	WatchdogReloadSet(WatchdogReloadGet());         //写入重装值 更新看门狗当前计时器
}
/*****************************************************************************
* 查看看门狗中断使能状态 
*****************************************************************************/
u8 WatchdogRunning(void)
{
    return(WDG->CTL & WDT_CTL_INTEN);
}

/*****************************************************************************
* 看门狗中断使能 
*****************************************************************************/
void WatchdogEnable(void)
{
    WDG->CTL |= WDT_CTL_INTEN;
}

/*****************************************************************************
* 看门狗复位使能 
*****************************************************************************/
void WatchdogResetEnable(void)
{
    WDG->CTL |= WDT_CTL_RESEN;
}

/*****************************************************************************
* 看门狗复位禁能
*****************************************************************************/
void WatchdogResetDisable(void)
{
    WDG->CTL &= ~(WDT_CTL_RESEN);
}

/*****************************************************************************
* 看门狗锁定(写禁能) 
*****************************************************************************/
void WatchdogLock(void)
{
    WDG->LOCK = WDT_LOCK_LOCKED;
}

/*****************************************************************************
* 看门狗解锁(写使能) 
*****************************************************************************/
void WatchdogUnlock(void)
{
    WDG->LOCK = WDT_LOCK_UNLOCK;
}

/*****************************************************************************
* 读看门狗锁定状态
* 锁定 返回true 否则返回false 
*****************************************************************************/
u8 WatchdogLockState(void)
{
    return((WDG->LOCK == WDT_LOCK_LOCKED) ? true : false);
}

/*****************************************************************************
* 设定看门狗重装值
*****************************************************************************/
void WatchdogReloadSet(u32 ulLoadVal)
{
    WDG->LOAD = ulLoadVal;
}

/*****************************************************************************
* 获取看门狗重装值
*****************************************************************************/
u32 WatchdogReloadGet(void)
{
    return(WDG->LOAD);
}

/*****************************************************************************
* 获取看门狗当前计数值
*****************************************************************************/
u32 WatchdogValueGet(void)
{
    return(WDG->VALUE);
}

/*****************************************************************************
* 设置看门狗中断入口服务程序入口
* 看门狗中断使能
*****************************************************************************/
void WatchdogIntRegister(void (*pfnHandler)(void))
{
    IntRegister(INT_WATCHDOG, pfnHandler);
    IntEnable(INT_WATCHDOG);
}

/*****************************************************************************
* 撤销看门狗中断入口服务程序入口
* 看门狗中断禁能
*****************************************************************************/
void WatchdogIntUnregister(void)
{
    IntDisable(INT_WATCHDOG);
    IntUnregister(INT_WATCHDOG);
}

/*****************************************************************************
* 看门狗中断使能
*****************************************************************************/
void WatchdogIntEnable(void)
{
    WDG->CTL |= WDT_CTL_INTEN;
}

/*****************************************************************************
* 获取看门狗中断状态
* bMasked =1 读取最终的中断状态
* bMasked =0 读取原始中断状态
*****************************************************************************/
u32	WatchdogIntStatus(u8 bMasked)
{
    if(bMasked)
     return(WDG->MIS);
    else
     return(WDG->RIS);
}

/*****************************************************************************
* 清除看门狗中断状态
*****************************************************************************/
void WatchdogIntClear(void)
{
    WDG->ICR = WDT_INT_TIMEOUT;
}

/*****************************************************************************
* 当调试器终止CPU时 看门狗终止运行
* 当调试器重新启动CPU后 看门狗启动运行
*****************************************************************************/
void WatchdogStallEnable(void)
{
    WDG->TEST |= WDT_TEST_STALL;
}

/*****************************************************************************
* 看门狗运行状态不受调试器影响
*****************************************************************************/
void WatchdogStallDisable(void)
{
    WDG->TEST &= ~(WDT_TEST_STALL);
}
